{
  "format": "layers-model",
  "generatedBy": "keras v3.5.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.5.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_1",
        "trainable": true,
        "dtype": "float32",
        "layers": [
          {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_shape": [
                                null,
                                200,
                                200,
                                3
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "name": "input_layer"
                        }
                    },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_3",
              "trainable": true,
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "activation": "relu"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_3",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2]
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "units": 128,
              "activation": "relu"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "units": 4,
              "activation": "softmax"
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of9.bin",
        "group1-shard2of9.bin",
        "group1-shard3of9.bin",
        "group1-shard4of9.bin",
        "group1-shard5of9.bin",
        "group1-shard6of9.bin",
        "group1-shard7of9.bin",
        "group1-shard8of9.bin",
        "group1-shard9of9.bin"
      ],
      "weights": [
        {
          "name": "sequential_1/conv2d_3/kernel",
          "shape": [3, 3, 3, 32],
          "dtype": "float32"
        },
        {
          "name": "sequential_1/conv2d_3/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "sequential_1/dense_2/kernel",
          "shape": [128, 4],
          "dtype": "float32"
        },
        {
          "name": "sequential_1/dense_2/bias",
          "shape": [128],
          "dtype": "float32"
        }
      ]
    }
  ]
}
